app/controllers/products_controller.rb

SELECT "products".* FROM "products"
---
	def index
		@companies = []
    if params[:query].nil?
      @products = []
    else
      @products = Product.search params[:query]

SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def find_product
		@product = Product.find(params[:id])